7767517
159 171
Input            input                    0 1 input
Convolution      284                      1 1 input 284 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1728
BatchNorm        285                      1 1 284 285 0=64
PReLU            286                      1 1 285 286 0=64
ConvolutionDepthWise 287                      1 1 286 287 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=576 7=64
BatchNorm        288                      1 1 287 288 0=64
PReLU            289                      1 1 288 289 0=64
Convolution      290                      1 1 289 290 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        291                      1 1 290 291 0=128
PReLU            292                      1 1 291 292 0=128
ConvolutionDepthWise 293                      1 1 292 293 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1152 7=128
BatchNorm        294                      1 1 293 294 0=128
PReLU            295                      1 1 294 295 0=128
Convolution      296                      1 1 295 296 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        297                      1 1 296 297 0=64
Split            splitncnn_0              1 2 297 297_splitncnn_0 297_splitncnn_1
Convolution      298                      1 1 297_splitncnn_1 298 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        299                      1 1 298 299 0=128
PReLU            300                      1 1 299 300 0=128
ConvolutionDepthWise 301                      1 1 300 301 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1152 7=128
BatchNorm        302                      1 1 301 302 0=128
PReLU            303                      1 1 302 303 0=128
Convolution      304                      1 1 303 304 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        305                      1 1 304 305 0=64
BinaryOp         306                      2 1 297_splitncnn_0 305 306 0=0
Split            splitncnn_1              1 2 306 306_splitncnn_0 306_splitncnn_1
Convolution      307                      1 1 306_splitncnn_1 307 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        308                      1 1 307 308 0=128
PReLU            309                      1 1 308 309 0=128
ConvolutionDepthWise 310                      1 1 309 310 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1152 7=128
BatchNorm        311                      1 1 310 311 0=128
PReLU            312                      1 1 311 312 0=128
Convolution      313                      1 1 312 313 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        314                      1 1 313 314 0=64
BinaryOp         315                      2 1 306_splitncnn_0 314 315 0=0
Split            splitncnn_2              1 2 315 315_splitncnn_0 315_splitncnn_1
Convolution      316                      1 1 315_splitncnn_1 316 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        317                      1 1 316 317 0=128
PReLU            318                      1 1 317 318 0=128
ConvolutionDepthWise 319                      1 1 318 319 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1152 7=128
BatchNorm        320                      1 1 319 320 0=128
PReLU            321                      1 1 320 321 0=128
Convolution      322                      1 1 321 322 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        323                      1 1 322 323 0=64
BinaryOp         324                      2 1 315_splitncnn_0 323 324 0=0
Split            splitncnn_3              1 2 324 324_splitncnn_0 324_splitncnn_1
Convolution      325                      1 1 324_splitncnn_1 325 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        326                      1 1 325 326 0=128
PReLU            327                      1 1 326 327 0=128
ConvolutionDepthWise 328                      1 1 327 328 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1152 7=128
BatchNorm        329                      1 1 328 329 0=128
PReLU            330                      1 1 329 330 0=128
Convolution      331                      1 1 330 331 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8192
BatchNorm        332                      1 1 331 332 0=64
BinaryOp         333                      2 1 324_splitncnn_0 332 333 0=0
Convolution      334                      1 1 333 334 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=16384
BatchNorm        335                      1 1 334 335 0=256
PReLU            336                      1 1 335 336 0=256
ConvolutionDepthWise 337                      1 1 336 337 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=2304 7=256
BatchNorm        338                      1 1 337 338 0=256
PReLU            339                      1 1 338 339 0=256
Convolution      340                      1 1 339 340 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        341                      1 1 340 341 0=128
Split            splitncnn_4              1 2 341 341_splitncnn_0 341_splitncnn_1
Convolution      342                      1 1 341_splitncnn_1 342 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        343                      1 1 342 343 0=256
PReLU            344                      1 1 343 344 0=256
ConvolutionDepthWise 345                      1 1 344 345 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        346                      1 1 345 346 0=256
PReLU            347                      1 1 346 347 0=256
Convolution      348                      1 1 347 348 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        349                      1 1 348 349 0=128
BinaryOp         350                      2 1 341_splitncnn_0 349 350 0=0
Split            splitncnn_5              1 2 350 350_splitncnn_0 350_splitncnn_1
Convolution      351                      1 1 350_splitncnn_1 351 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        352                      1 1 351 352 0=256
PReLU            353                      1 1 352 353 0=256
ConvolutionDepthWise 354                      1 1 353 354 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        355                      1 1 354 355 0=256
PReLU            356                      1 1 355 356 0=256
Convolution      357                      1 1 356 357 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        358                      1 1 357 358 0=128
BinaryOp         359                      2 1 350_splitncnn_0 358 359 0=0
Split            splitncnn_6              1 2 359 359_splitncnn_0 359_splitncnn_1
Convolution      360                      1 1 359_splitncnn_1 360 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        361                      1 1 360 361 0=256
PReLU            362                      1 1 361 362 0=256
ConvolutionDepthWise 363                      1 1 362 363 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        364                      1 1 363 364 0=256
PReLU            365                      1 1 364 365 0=256
Convolution      366                      1 1 365 366 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        367                      1 1 366 367 0=128
BinaryOp         368                      2 1 359_splitncnn_0 367 368 0=0
Split            splitncnn_7              1 2 368 368_splitncnn_0 368_splitncnn_1
Convolution      369                      1 1 368_splitncnn_1 369 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        370                      1 1 369 370 0=256
PReLU            371                      1 1 370 371 0=256
ConvolutionDepthWise 372                      1 1 371 372 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        373                      1 1 372 373 0=256
PReLU            374                      1 1 373 374 0=256
Convolution      375                      1 1 374 375 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        376                      1 1 375 376 0=128
BinaryOp         377                      2 1 368_splitncnn_0 376 377 0=0
Split            splitncnn_8              1 2 377 377_splitncnn_0 377_splitncnn_1
Convolution      378                      1 1 377_splitncnn_1 378 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        379                      1 1 378 379 0=256
PReLU            380                      1 1 379 380 0=256
ConvolutionDepthWise 381                      1 1 380 381 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        382                      1 1 381 382 0=256
PReLU            383                      1 1 382 383 0=256
Convolution      384                      1 1 383 384 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        385                      1 1 384 385 0=128
BinaryOp         386                      2 1 377_splitncnn_0 385 386 0=0
Split            splitncnn_9              1 2 386 386_splitncnn_0 386_splitncnn_1
Convolution      387                      1 1 386_splitncnn_1 387 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        388                      1 1 387 388 0=256
PReLU            389                      1 1 388 389 0=256
ConvolutionDepthWise 390                      1 1 389 390 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        391                      1 1 390 391 0=256
PReLU            392                      1 1 391 392 0=256
Convolution      393                      1 1 392 393 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        394                      1 1 393 394 0=128
BinaryOp         395                      2 1 386_splitncnn_0 394 395 0=0
Convolution      396                      1 1 395 396 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=65536
BatchNorm        397                      1 1 396 397 0=512
PReLU            398                      1 1 397 398 0=512
ConvolutionDepthWise 399                      1 1 398 399 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=4608 7=512
BatchNorm        400                      1 1 399 400 0=512
PReLU            401                      1 1 400 401 0=512
Convolution      402                      1 1 401 402 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=65536
BatchNorm        403                      1 1 402 403 0=128
Split            splitncnn_10             1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution      404                      1 1 403_splitncnn_1 404 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        405                      1 1 404 405 0=256
PReLU            406                      1 1 405 406 0=256
ConvolutionDepthWise 407                      1 1 406 407 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        408                      1 1 407 408 0=256
PReLU            409                      1 1 408 409 0=256
Convolution      410                      1 1 409 410 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        411                      1 1 410 411 0=128
BinaryOp         412                      2 1 403_splitncnn_0 411 412 0=0
Split            splitncnn_11             1 2 412 412_splitncnn_0 412_splitncnn_1
Convolution      413                      1 1 412_splitncnn_1 413 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        414                      1 1 413 414 0=256
PReLU            415                      1 1 414 415 0=256
ConvolutionDepthWise 416                      1 1 415 416 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2304 7=256
BatchNorm        417                      1 1 416 417 0=256
PReLU            418                      1 1 417 418 0=256
Convolution      419                      1 1 418 419 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=32768
BatchNorm        420                      1 1 419 420 0=128
BinaryOp         421                      2 1 412_splitncnn_0 420 421 0=0
Convolution      422                      1 1 421 422 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=65536
BatchNorm        423                      1 1 422 423 0=512
PReLU            424                      1 1 423 424 0=512
ConvolutionDepthWise 425                      1 1 424 425 0=512 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=25088 7=512
BatchNorm        426                      1 1 425 426 0=512
Flatten          427                      1 1 426 427
InnerProduct     429                      1 1 427 429 0=512 1=0 2=262144
BatchNorm        output                   1 1 429 output 0=512
